<div style=" background-color: RGB(0,114,200);" >
<h1 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">PROJET 06 DATA ANALYST</h1>
<h2 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">Analysez les ventes d'une librairie avec R ou Python
<h3 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">PARTIE NETTOYAGE DES DONNEES
</h2>
</div>

In [74]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

<div style="border: 1px solid RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">1 - Preparation du fichier customers</h3>
</div>

In [75]:
# Chargement du fichier CSV 'customers.csv' 
df_customers=pd.read_csv('customers.csv', delimiter=';', encoding='utf-8')
df_customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [76]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8621 entries, 0 to 8620
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8621 non-null   object
 1   sex        8621 non-null   object
 2   birth      8621 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [77]:
#verivication de l'unicit√© du PK
df_customers.duplicated(subset=['client_id']).sum()

0

In [78]:
#renommer la colonne sex par genre
df_customers.rename(columns={"sex": "genre"},inplace=True)
df_customers.head()

  client_id genre  birth
0    c_4410     f   1967
1    c_7839     f   1975
2    c_1699     f   1984
3    c_5961     f   1962
4    c_5320     m   1943

In [79]:
#calcul de l'age sur une colonne 'age'
df_customers['age']= 2023 - df_customers['birth']
df_customers.head()

  client_id genre  birth  age
0    c_4410     f   1967   56
1    c_7839     f   1975   48
2    c_1699     f   1984   39
3    c_5961     f   1962   61
4    c_5320     m   1943   80

<div style="border: 1px solid RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">2 - Preparation du fichier products</h3>
</div>

In [80]:
#chargement du fichier CSV 'products.csv' 
df_products=pd.read_csv('products.csv', delimiter=';', encoding='utf-8')  
df_products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [81]:
#verification des nombres de lignes ,types et nobre de valeurs non-null pour chaque colonne
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3286 entries, 0 to 3285
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3286 non-null   object
 1   price    3286 non-null   float64
 2   categ    3286 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.1+ KB

In [82]:
#verivication de l'unicit√© du PK
df_products.duplicated(subset=['id_prod']).sum()

0

<div style="border: 1px solid RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">3 - Preparation du fichier Transactions</h3>
</div>

In [83]:
#chargement du fichier CSV 'Transactions.csv' 
df_transactions=pd.read_csv('Transactions.csv', delimiter=';', encoding='utf-8')
df_transactions.head()

  id_prod                        date session_id client_id
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033

In [84]:
#verification des nombres de lignes ,types et nobre de valeurs non-null pour chaque colonne
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 687534 entries, 0 to 687533
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     687534 non-null  object
 1   date        687534 non-null  object
 2   session_id  687534 non-null  object
 3   client_id   687534 non-null  object
dtypes: object(4)
memory usage: 21.0+ MB

In [85]:
#cr√©ation d'une nouvelle colonne 'day' dans le DataFrame df_transactions en transforfant la variable 'date' via la fonction lambda
df_transactions['day']=df_transactions.date.apply(lambda x: x[:10])
df_transactions.head()

  id_prod                        date session_id client_id         day
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329  2021-03-01
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664  2021-03-01
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580  2021-03-01
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912  2021-03-01
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033  2021-03-01

In [86]:
#convertir la colonne 'date' en datetime avec gestion des erreurs
df_transactions['day'] = pd.to_datetime(df_transactions['day'])
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 687534 entries, 0 to 687533
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     687534 non-null  object
 1   date        687534 non-null  object
 2   session_id  687534 non-null  object
 3   client_id   687534 non-null  object
 4   day         687534 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 26.2+ MB

In [87]:
#cr√©ation d'une nouvelle colonne 'mounth' dans le DataFrame df_transactions
df_transactions['mounth'] = df_transactions['day'].dt.strftime('%Y-%m')
df_transactions.head()

  id_prod                        date session_id client_id        day   mounth
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329 2021-03-01  2021-03
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664 2021-03-01  2021-03
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580 2021-03-01  2021-03
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912 2021-03-01  2021-03
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033 2021-03-01  2021-03

In [88]:
#calcul du nombre de lignes en double dans le DataFrame df_transactions en se basant sur les colonnes 'session_id', 'client_id', et 'id_prod'
df_transactions.duplicated(subset=['session_id','client_id','id_prod']).sum()

855

<div style="border: 1px solid RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">4 - Preparation des jointures des 3 dataframe</h3>
</div>

In [89]:
#jointure √† droite entre les 2 dataframe df_Transactions et df_customers suivant la colone 'client_id'
df_transaction_customers= pd.merge(df_transactions,df_customers,on='client_id', how='outer',indicator='merge_indicator')
df_transaction_customers.head()

,id_prod,date,session_id,client_id,day,mounth,genre,birth,age,merge_indicator
0,0_1259,2021-03-01 00:01:07.843138,s_1,c_329,2021-03-01,2021-03,f,1967,56,both
1,1_498,2021-03-11 00:57:22.865244,s_4624,c_329,2021-03-11,2021-03,f,1967,56,both
2,0_1140,2021-03-16 10:01:30.705174,s_7071,c_329,2021-03-16,2021-03,f,1967,56,both
3,1_451,2021-03-18 17:26:18.887580,s_8134,c_329,2021-03-18,2021-03,f,1967,56,both
4,1_381,2021-04-25 13:26:06.218857,s_25561,c_329,2021-04-25,2021-04,f,1967,56,both

In [90]:
#verification des nombres de lignes ,types et nombres de valeurs non-null pour chaque colonne
df_transaction_customers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 687555 entries, 0 to 687554
Data columns (total 10 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id_prod          687534 non-null  object
 1   date             687534 non-null  object
 2   session_id       687534 non-null  object
 3   client_id        687555 non-null  object
 4   day              687534 non-null  datetime64[ns]
 5   mounth           687534 non-null  object
 6   genre            687555 non-null  object
 7   birth            687555 non-null  int64
 8   age              687555 non-null  int64
 9   merge_indicator  687555 non-null  category
dtypes: category(1), datetime64[ns](1), int64(2), object(6)
memory usage: 53.1+ MB

In [91]:
#selection des diff√©rents merge_indicator 
df_transaction_customers['merge_indicator'].unique()

['both', 'right_only']
Categories (3, object): ['left_only', 'right_only', 'both']

In [92]:
#selection des lignes avec merge_indicator = 'right_only'
df_transaction_customers[df_transaction_customers['merge_indicator'] == 'right_only' ].client_id.unique()

array(['c_8253', 'c_3789', 'c_4406', 'c_2706', 'c_3443', 'c_4447',
       'c_3017', 'c_4086', 'c_6930', 'c_4358', 'c_8381', 'c_1223',
       'c_6862', 'c_5245', 'c_5223', 'c_6735', 'c_862', 'c_7584', 'c_90',
       'c_587', 'c_3526'], dtype=object)

In [93]:
#nombre des lignes avec merge_indicator = 'right_only'
(df_transaction_customers['merge_indicator'] == 'right_only').sum()

21

## ceci signifie qu'il y'a des clients qui n'ach√©tent pas en ligne

In [94]:
#suppression des lignes avec merge_indicator = 'right_only'
df_transaction_customers.drop(df_transaction_customers[df_transaction_customers['merge_indicator']=='right_only'].index,inplace=True)
df_transaction_customers[df_transaction_customers['merge_indicator']=='right_only']

Empty DataFrame
Columns: [id_prod, date, session_id, client_id, day, mounth, genre, birth, age, merge_indicator]
Index: []

In [95]:
#selection des lignes avec merge_indicator = 'left_only'
df_transaction_customers[df_transaction_customers['merge_indicator'] == 'left_only' ]

Empty DataFrame
Columns: [id_prod, date, session_id, client_id, day, mounth, genre, birth, age, merge_indicator]
Index: []

In [96]:
#jointure externe entre les 2 dataframe Transaction_customers et df_products suivant la colone 'id_prod'
df_total= pd.merge(df_transaction_customers,df_products,on='id_prod',how='outer',indicator='merge_indicator_2')
df_total.head()

,id_prod,date,session_id,client_id,day,mounth,genre,birth,age,merge_indicator,price,categ,merge_indicator_2
0,0_1259,2021-03-01 00:01:07.843138,s_1,c_329,2021-03-01,2021-03,f,1967.0,56.0,both,11.99,0,both
1,0_1259,2022-10-01 00:01:07.843138,s_275943,c_329,2022-10-01,2022-10,f,1967.0,56.0,both,11.99,0,both
2,0_1259,2022-12-01 00:01:07.843138,s_305291,c_329,2022-12-01,2022-12,f,1967.0,56.0,both,11.99,0,both
3,0_1259,2023-01-01 00:01:07.843138,s_320153,c_329,2023-01-01,2023-01,f,1967.0,56.0,both,11.99,0,both
4,0_1259,2021-03-04 07:26:01.343183,s_1519,c_1609,2021-03-04,2021-03,m,1980.0,43.0,both,11.99,0,both

In [97]:
#verification des nobres de lignes ,types et nombre de valeurs non-null pour chaque colonnes
df_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 687555 entries, 0 to 687554
Data columns (total 13 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   id_prod            687555 non-null  object
 1   date               687534 non-null  object
 2   session_id         687534 non-null  object
 3   client_id          687534 non-null  object
 4   day                687534 non-null  datetime64[ns]
 5   mounth             687534 non-null  object
 6   genre              687534 non-null  object
 7   birth              687534 non-null  float64
 8   age                687534 non-null  float64
 9   merge_indicator    687534 non-null  category
 10  price              687555 non-null  float64
 11  categ              687555 non-null  int64
 12  merge_indicator_2  687555 non-null  category
dtypes: category(2), datetime64[ns](1), float64(3), int64(1), object(6)
memory usage: 64.3+ MB

In [98]:
#selection des lignes avec merge_indicator = 'left_only'
df_total[df_total['merge_indicator_2'] == 'left_only' ]

Empty DataFrame
Columns: [id_prod, date, session_id, client_id, day, mounth, genre, birth, age, merge_indicator, price, categ, merge_indicator_2]
Index: []

In [99]:
#selection des lignes avec merge_indicator = 'right_only'
df_total[df_total['merge_indicator_2'] == 'right_only' ].head()

,id_prod,date,session_id,client_id,day,mounth,genre,birth,age,merge_indicator,price,categ,merge_indicator_2
687534,0_1016,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,35.06,0,right_only
687535,0_1780,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,1.67,0,right_only
687536,0_1062,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,20.08,0,right_only
687537,0_1119,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,2.99,0,right_only
687538,0_1014,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,1.15,0,right_only

In [100]:
#nombre des lignes avec merge_indicator = 'right_only'
(df_total['merge_indicator_2'] == 'right_only').sum()

21

## ceci signifie qu'il y'a des produits que personne ne les ach√©te

In [101]:
#suppression des lignes avec merge_indicator = 'right_only'
df_total.drop(df_total[df_total['merge_indicator_2']=='right_only'].index,inplace=True)
df_total[df_total['merge_indicator_2']=='right_only']

Empty DataFrame
Columns: [id_prod, date, session_id, client_id, day, mounth, genre, birth, age, merge_indicator, price, categ, merge_indicator_2]
Index: []

In [102]:
#suppression des colonnes merge_indicator et merge_indicator_2
df_total = df_total.drop(['merge_indicator', 'merge_indicator_2','birth','date'], axis=1)
df_total.head()

  id_prod session_id client_id        day   mounth genre   age  price  categ
0  0_1259        s_1     c_329 2021-03-01  2021-03     f  56.0  11.99      0
1  0_1259   s_275943     c_329 2022-10-01  2022-10     f  56.0  11.99      0
2  0_1259   s_305291     c_329 2022-12-01  2022-12     f  56.0  11.99      0
3  0_1259   s_320153     c_329 2023-01-01  2023-01     f  56.0  11.99      0
4  0_1259     s_1519    c_1609 2021-03-04  2021-03     m  43.0  11.99      0

In [103]:
#verification des nombres de lignes ,types et nobre de valeurs non-null pour chaque colonne
df_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 687534 entries, 0 to 687533
Data columns (total 9 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     687534 non-null  object
 1   session_id  687534 non-null  object
 2   client_id   687534 non-null  object
 3   day         687534 non-null  datetime64[ns]
 4   mounth      687534 non-null  object
 5   genre       687534 non-null  object
 6   age         687534 non-null  float64
 7   price       687534 non-null  float64
 8   categ       687534 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 52.5+ MB

In [104]:
#sauvegarde du DataFrame df_total au format CSV
df_total.to_csv('df_total.csv',index=False)